using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace DescribeDifference
{
    class DescribeDifference
    {
        static void Main(string[] args)
        {
            //10. Describe the difference between C# and .NET Framework.


            /*
             
             C# е един от езиците от високо ниво, които се поддържат от .NET Framework за разработката на .NET приложения.
             
             .NET Framework е част от .NET платформата – тази част, която е насочена към разработчиците на софтуер. 
             Тя осигурява среда за разработка и контролирано изпълнение на .NET приложения и предоставя програмен модел и 
             библиотеки от класове за разработка, независима от езиците за програмиране.                          
             .NET Framework поддържа различни езици от високо ниво (C#, VB.NET, Managed C++ и други) и позволява тяхната съвместна работа. 
             .NET приложенията се компилират до междинен език от ниско ниво, наречен IL (Intermediate Language). 
             По време на изпълнение IL програмите (т. нар. управляван код) се компилират до инструкции за текущата хардуерна архитектура, 
             съобразени с текущата операционна система, и след това се изпълняват от микропроцесора.
             Компилираният .NET код се нарича още управляван код и може да работи без да се прекомпилира върху различни платформи, за които има имплементация за .NET Framework (Windows, Linux, FreeBSD).
            .NET Framework включва в себе си стандартна библиотека, която съдържа базова функционалност за разработка, необходима за повечето приложения, 
             като вход/изход, връзка с бази данни, работа с XML, изграждане на уеб приложения, използване на уеб услуги, 
             изграждане на графичен пот-ребителски интерфейс и др.
                         
             */

        }
    }
}
